trade_exp/src/InformationRegisters/РазмещениеНоменклатурыПоСкладскимЯчейкам/РазмещениеНоменклатурыПоСкладскимЯчейкам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>РазмещениеНоменклатурыПоСкладскимЯчейкам</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>ОсновнаяЯчейка</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Ячейка</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="7150e659-c510-45e5-9deb-fddf7441e996">
    <name>Помещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/ДокументыВСборке/ДокументыВСборке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="40180f04-3b40-4848-9465-d728a7203291">
  <name>ДокументыВСборке</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="7c4c1222-549a-43f3-a941-cd3330576101">
    <name>ДатаПоступленияВСборку</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="62c95196-3837-47f2-ab7b-140c3e5730c1">
    <name>Документ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Enums/СтатусыРасходныхОрдеров/СтатусыРасходныхОрдеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="d873fb7c-bffd-4ee5-9885-25af6032a41f">
  <name>СтатусыРасходныхОрдеров</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="5394523f-1d18-4bb7-94ac-c5f9ed62888e">
    <name>КОтбору</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="2fcc0b73-2f07-413e-aa8c-c99b38f0655b">
    <name>Подготовлен</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="9a7f17cc-0bed-409a-bf22-547957e4b4a3">
    <name>КПроверке</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="92258e4f-ec60-44a5-9ef6-60af9d22d0f4">
    <name>ВПроцессеПроверки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="47a95af3-e94f-43dd-b105-b0009956fe02">
    <name>КОтгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="bdc2dd3b-b02c-4815-af56-2538b334fbf4">
    <name>Отгружен</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/СтатусыРеализацийТоваровУслуг/СтатусыРеализацийТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтатусыРеализацийТоваровУслуг</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ВПути</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Отгружено</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="56f07675-a2f8-4ddb-9844-2f6199f18f86">
    <name>КПредоплате</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Documents/РасходныйОрдерНаТовары/РасходныйОрдерНаТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e5b57481-c7d7-459c-8f38-003976928dcf">
  <name>РасходныйОрдерНаТовары</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.ДвижениеМаркированногоТовара</registerRecords>
  <attributes extendedConfigurationObject="c578192a-6448-4799-ac7a-946fede4b1fa">
    <name>РабочийУчасток</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="89cd1a11-c961-49a0-b7ea-67cc67387e68">
    <name>СкладскаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="63f1d0df-8450-40b2-a6bf-26e9a9bc348d">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="00a21d2c-dfa9-40aa-938f-3fe890533f41">
    <name>ПорядокДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="96ee5655-e55c-4d9d-9386-a82e47bcd733">
    <name>ДатаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="07d94e4d-722d-4939-a3da-ba2a3afba256">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="145a504e-53c5-4349-a710-b106ea052174">
    <name>Получатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b4c013e1-f51f-4900-840f-f755e500fa76">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5fb4b5c4-30c2-4b89-82ff-7057477218df">
    <name>Помещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1e82bc85-5efe-473f-a2a6-04b053896ef5">
    <name>ЗонаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6a9f8399-4614-4cb5-ba80-210c90c11e54">
    <name>Приоритет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="49f3e5fd-cf9c-4585-8222-c47ae930e2dd">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5d8985e0-1a5e-4908-ba86-c4b692cd1634">
    <name>Контролер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="47e1733e-b075-4282-944c-d07d96cd86a9">
    <name>ВсегоМест</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="8ee7ff7a-ec43-4840-800d-22245c14dc90">
    <name>РежимПросмотраПоТоварам</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="08a6fc5b-ac14-420f-987d-169c39288bf4">
    <name>ЗаданиеНаПеревозку</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6ac78645-99c6-4dd6-9e7a-1a60a918a880">
    <name>Накладная</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="71e89e4b-8b80-42ba-ad22-143b0015eb7c">
    <name>ЯчейкаПромежуточногоХранения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="29d823c9-7e0c-4440-a6f7-0759575e73ac">
    <name>ПричинаОтказаОтСборки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="488f5004-17e0-4162-b7a3-08a11e08045c">
    <name>Сотрудник</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="389dae2c-5f04-4c10-8555-7103bd0c3f21">
    <name>ОтгружаемыеТовары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="26cd1a83-599c-4cb2-88f4-8da57cd2dfaf">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="0185ac19-4e81-475e-842b-4f1cec88f0d3">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="152a5a3e-8c56-4983-9052-b8b75a6e0d12">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="8666ee78-482b-4c09-9baa-791917648dbd">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="c4e6782d-54b8-4614-8549-b94f2af33d1b">
      <name>Действие</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b9cf586a-fbd5-4e5f-a0f7-df3ef40e11d2">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="93ae14aa-f407-4566-96ba-2cbba0eadcc2">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="fc35a8ee-3531-4b7e-8222-611bb0bc88ab">
      <name>УпаковочныйЛист</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="40dd6af6-2e66-4e56-b31e-687455807ff2">
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="628b3ce2-4791-489a-9690-8cc51d7f27c4">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="f93cbc89-602b-4c37-a90c-1bceda80afe7">
    <name>ТоварыПоРаспоряжениям</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="83f29f84-a577-47ce-933a-46184309914f">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="83b872e0-168f-4cbc-b791-68c2edf79de4">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="cd7cf0b2-0078-4dfa-b137-5418e69d7024">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="8e2e117e-50d4-46cf-9e08-ea6f475d1cca">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="07df2cb8-3a48-4671-b17f-d2bf82e412f8">
      <name>Распоряжение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ae04c7e3-73f4-4a07-bef6-baf69fcb4dfc">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="71ec9ff7-b367-4f30-a98e-368c90e6ac5f">
    <name>ШтрихкодыУпаковок</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="92946722-2614-4655-8fe5-999f3c499fd0">
      <name>ШтрихкодУпаковки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/CommonModules/РСС_УправлениеОчередьюИСборкойЗаказов/Module.bsl
//Функция формирует движения для регистра "Проблемные документы":
//по Ордеру при создании делает движения с признаком "Эталон" т.е. 
//это движения, которые до изменений
//При внесении изменений в Ордер, либо в реализацию, по данному регистру делаются движения
//с признаком "Ордер", либо "Реализация" - это строки отличия от эталона.
Функция СформироватьНаборЗаписейДляПроблемныхЗаявок(Ссылка, УдолениеДвижений=Ложь) Экспорт

	ЭтоОрдер = (ТипЗнч(ССылка) = Тип("ДокументСсылка.РасходныйОрдерНаТовары"));
	Ордер            = ?(ЭтоОрдер,Ссылка,ВернутьПодчиненныйОрдер(Ссылка));
	ДокументОтгрузки = ?(ЭтоОрдер,Ордер.Распоряжение,Ссылка);
	//1. Если нет ордера, то ничего не делаем
	Если Не ЗначениеЗаполнено(Ордер) Тогда
		Возврат Истина;
	КонецЕсли;	
	//2. Документ уже отработан. Чистим движения при наличии таковых
	Если ОрдерНабран(Ссылка,ЭтоОрдер) или УдолениеДвижений Тогда
		НЗ = РегистрыСведений.ПроблемныеОтгрузки.СоздатьНаборЗаписей();
		НЗ.Отбор.ДокументОтгрузки.Установить(ДокументОтгрузки);
		НЗ.Прочитать();
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ПроблемныеОтгрузки");
		ЭлементБлокировки.УстановитьЗначение("ДокументОтгрузки", ДокументОтгрузки);
		ЭлементБлокировки.УстановитьЗначение("Ордер", Ордер);
		Попытка
			Блокировка.Заблокировать();
			Если НЗ.Количество()>0 Тогда
				НЗ.Очистить();
				НЗ.Записать();
			КонецЕсли;
		Исключение
			Сообщить("Не удалось сформировать движения по регистру ""Проблеммные документы"" по причине: "+ОписаниеОшибки());
			Возврат Ложь;
		КонецПопытки;
		Возврат Истина; //Результат
	КонецЕсли;	
	//2 Получаем полную таблицу записей для Ордера и Документа отгрузки
	ТЗ = ПолучитьТаблицуЗаписейПроблемныхДокументов(Ордер, ДокументОтгрузки);
	//Блокируем записи нашего документа
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ПроблемныеОтгрузки");
	ЭлементБлокировки.УстановитьЗначение("ДокументОтгрузки", ДокументОтгрузки);
	ЭлементБлокировки.УстановитьЗначение("Ордер", Ордер);
	Попытка
		Блокировка.Заблокировать();
		НЗ = РегистрыСведений.ПроблемныеОтгрузки.СоздатьНаборЗаписей();
		НЗ.Отбор.ДокументОтгрузки.Установить(ДокументОтгрузки);
		НЗ.Загрузить(тз);
		НЗ.Записать();
		Если тз.Найти(Перечисления.ВидыЗаписейПроблемныхДокументов.Накладная)<>Неопределено Тогда
			ОбъектОрдера = Ордер.ПолучитьОбъект();
			ОбъектОрдера.ЕстьИзмененияВНакладной = Истина;
			ОбъектОрдера.Записать(РежимЗаписиДокумента.Запись)
		КонецЕсли;	
		Возврат Истина
	Исключение
		Сообщить("Не удалось сформировать движения по регистру ""Проблеммные документы"" по причине: "+ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;	
	
КонецФункции

//Возвращает подчиненный, проведенный ордер
//иначе - неопределено
Функция ВернутьПодчиненныйОрдер(Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасходныйОрдерНаТовары.Ссылка КАК Ордер
	|ИЗ
	|	Документ.РасходныйОрдерНаТовары КАК РасходныйОрдерНаТовары
	|ГДЕ
	|	РасходныйОрдерНаТовары.Проведен
	|	И РасходныйОрдерНаТовары.Распоряжение = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ордер;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

//Возвращает истину, если ордер уже набран.
Функция ОрдерНабран(Ссылка, ЭтоОрдер=Ложь) Экспорт
	
	Если ЭтоОрдер Тогда
		МасЗапрещенныхСтатусов = Новый Массив;
		МасЗапрещенныхСтатусов.Добавить(Перечисления.СтатусыРасходныхОрдеров.ВПроцессеПроверки);
		МасЗапрещенныхСтатусов.Добавить(Перечисления.СтатусыРасходныхОрдеров.КПроверке);
		МасЗапрещенныхСтатусов.Добавить(Перечисления.СтатусыРасходныхОрдеров.Отгружен);
		Возврат МасЗапрещенныхСтатусов.Найти(Ссылка.Статус)<>Неопределено;
	Иначе		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходныйОрдерНаТовары.Статус
		|ИЗ
		|	Документ.РасходныйОрдерНаТовары КАК РасходныйОрдерНаТовары
		|ГДЕ
		|	РасходныйОрдерНаТовары.Распоряжение = &Ссылка
		|	И РасходныйОрдерНаТовары.Проведен
		|	И РасходныйОрдерНаТовары.Статус В (&МасЗапрещенныхСтатусов)";
		
		Запрос.УстановитьПараметр("МасЗапрещенныхСтатусов", МасЗапрещенныхСтатусов);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Возврат Не РезультатЗапроса.Пустой();	
	КонецЕсли;
	
КонецФункции

Функция ОграничитьДоступностьПриНаличииОрдераВСтатусе(Ссылка)
	
	МасЗапрещенныхСтатусов = Новый Массив;
	МасЗапрещенныхСтатусов.Добавить(Перечисления.СтатусыРасходныхОрдеров.ВПроцессеПроверки);
	МасЗапрещенныхСтатусов.Добавить(Перечисления.СтатусыРасходныхОрдеров.КПроверке);
	МасЗапрещенныхСтатусов.Добавить(Перечисления.СтатусыРасходныхОрдеров.Отгружен);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасходныйОрдерНаТовары.Ссылка
	|ИЗ
	|	Документ.РасходныйОрдерНаТовары КАК РасходныйОрдерНаТовары
	|ГДЕ
	|	РасходныйОрдерНаТовары.Статус В(&МасЗапрещенныхСтатусов)
	|	И РасходныйОрдерНаТовары.Проведен
	|	И РасходныйОрдерНаТовары.Распоряжение = &Ссылка";
	
	Запрос.УстановитьПараметр("МасЗапрещенныхСтатусов", МасЗапрещенныхСтатусов);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат ?(РезультатЗапроса.Пустой(),Ложь,Истина);
	
КонецФункции

Функция ИзменениеПризнакаРеализацииЕслиЕстьСобранныйОрдер(Ссылка,УстановливаемыйСтатус=Истина) Экспорт
	
	Если ТипЗнч(Ссылка.Распоряжение) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		МасЗапрещенныхСтатусов = Новый Массив;
		МасЗапрещенныхСтатусов.Добавить(Перечисления.СтатусыРасходныхОрдеров.ВПроцессеПроверки);
		МасЗапрещенныхСтатусов.Добавить(Перечисления.СтатусыРасходныхОрдеров.КПроверке);
		МасЗапрещенныхСтатусов.Добавить(Перечисления.СтатусыРасходныхОрдеров.Отгружен);
		Если МасЗапрещенныхСтатусов.Найти(Ссылка.Статус)<>Неопределено Тогда
			Если  Ссылка.Распоряжение.ЕстьСобранныйОрдер <> УстановливаемыйСтатус Тогда
				ОбъРеализации = Ссылка.Распоряжение.ПолучитьОбъект();
				ОбъРеализации.ЕстьСобранныйОрдер = УстановливаемыйСтатус;
				ОбъРеализации.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
		Иначе
			Если  Ссылка.Распоряжение.ЕстьСобранныйОрдер <> Ложь Тогда
				ОбъРеализации = Ссылка.Распоряжение.ПолучитьОбъект();
				ОбъРеализации.ЕстьСобранныйОрдер = Ложь;
				ОбъРеализации.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	
КонецФункции

Функция ПолучитьТаблицуЗаписейПроблемныхДокументов(Ордер, ДокументОтгрузки)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;

	Запрос.Текст = "ВЫБРАТЬ
	               |	ПроблемныеОтгрузки.ДокументОтгрузки КАК ДокументОтгрузки,
	               |	ПроблемныеОтгрузки.Ордер КАК Ордер,
	               |	ПроблемныеОтгрузки.ВидЗаписи КАК ВидЗаписи,
	               |	ПроблемныеОтгрузки.Номенклатура КАК Номенклатура,
	               |	ПроблемныеОтгрузки.Характеристика КАК Характеристика,
	               |	ПроблемныеОтгрузки.Секция КАК Секция,
	               |	ПроблемныеОтгрузки.Количество КАК Количество
	               |ПОМЕСТИТЬ _01_Эталон
	               |ИЗ
	               |	РегистрСведений.ПроблемныеОтгрузки КАК ПроблемныеОтгрузки
	               |ГДЕ
	               |	ПроблемныеОтгрузки.ДокументОтгрузки.Ссылка = &Ссылка
	               |	И ПроблемныеОтгрузки.ВидЗаписи = ЗНАЧЕНИЕ(Перечисление.ВидыЗаписейПроблемныхДокументов.Эталон)
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ДокументОтгрузки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РасходныйОрдерНаТоварыТовары.Ссылка.Распоряжение КАК ДокументОтгрузки,
	               |	РасходныйОрдерНаТоварыТовары.Ссылка КАК Ордер,
	               |	ЗНАЧЕНИЕ(Перечисление.ВидыЗаписейПроблемныхДокументов.Эталон) КАК ВидЗаписи,
	               |	РасходныйОрдерНаТоварыТовары.Номенклатура КАК Номенклатура,
	               |	РасходныйОрдерНаТоварыТовары.Характеристика КАК Характеристика,
	               |	РазмещениеОсновнаяЯчейка.Ячейка.РабочийУчасток КАК Секция,
	               |	РасходныйОрдерНаТоварыТовары.Количество КАК Количество
	               |ПОМЕСТИТЬ _02_Эталон
	               |ИЗ
	               |	Документ.РасходныйОрдерНаТовары.Товары КАК РасходныйОрдерНаТоварыТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеОсновнаяЯчейка
	               |		ПО (РазмещениеОсновнаяЯчейка.Номенклатура = РасходныйОрдерНаТоварыТовары.Номенклатура)
	               |			И (РазмещениеОсновнаяЯчейка.ОсновнаяЯчейка = ИСТИНА)
	               |			И РасходныйОрдерНаТоварыТовары.Ссылка.Склад = РазмещениеОсновнаяЯчейка.Склад
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			КОЛИЧЕСТВО(_0_Эталон.ДокументОтгрузки) КАК ЕстьЗаписи
	               |		ИЗ
	               |			_01_Эталон КАК _0_Эталон) КАК ВложенныйЗапрос
	               |		ПО (ЕСТЬNULL(ВложенныйЗапрос.ЕстьЗаписи, 0) = 0
	               |				ИЛИ ВложенныйЗапрос.ЕстьЗаписи ЕСТЬ NULL )
	               |ГДЕ
	               |	РасходныйОрдерНаТоварыТовары.Ссылка.Распоряжение = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	_01_Эталон.ДокументОтгрузки КАК ДокументОтгрузки,
	               |	_01_Эталон.Ордер КАК Ордер,
	               |	_01_Эталон.ВидЗаписи КАК ВидЗаписи,
	               |	_01_Эталон.Номенклатура КАК Номенклатура,
	               |	_01_Эталон.Характеристика КАК Характеристика,
	               |	_01_Эталон.Секция КАК Секция,
	               |	_01_Эталон.Количество КАК Количество
	               |ПОМЕСТИТЬ _0_Эталон
	               |ИЗ
	               |	_01_Эталон КАК _01_Эталон
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	_02_Эталон.ДокументОтгрузки,
	               |	_02_Эталон.Ордер,
	               |	_02_Эталон.ВидЗаписи,
	               |	_02_Эталон.Номенклатура,
	               |	_02_Эталон.Характеристика,
	               |	_02_Эталон.Секция,
	               |	_02_Эталон.Количество
	               |ИЗ
	               |	_02_Эталон КАК _02_Эталон
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Номенклатура,
	               |	Характеристика
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВложенныйЗапрос.ДокументОтгрузки КАК ДокументОтгрузки,
	               |	ВложенныйЗапрос.Ордер КАК Ордер,
	               |	ЗНАЧЕНИЕ(Перечисление.ВидыЗаписейПроблемныхДокументов.Ордер) КАК ВидЗаписи,
	               |	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	               |	ВложенныйЗапрос.Характеристика КАК Характеристика,
	               |	ВложенныйЗапрос.Секция КАК Секция,
	               |	СУММА(ВложенныйЗапрос.Количество) КАК Количество
	               |ПОМЕСТИТЬ ИзмененыВОрдере
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		РасходныйОрдерНаТоварыТовары.Ссылка.Распоряжение КАК ДокументОтгрузки,
	               |		РасходныйОрдерНаТоварыТовары.Ссылка КАК Ордер,
	               |		ЗНАЧЕНИЕ(Перечисление.ВидыЗаписейПроблемныхДокументов.Эталон) КАК ВидЗаписи,
	               |		РасходныйОрдерНаТоварыТовары.Номенклатура КАК Номенклатура,
	               |		РасходныйОрдерНаТоварыТовары.Характеристика КАК Характеристика,
	               |		РазмещениеОсновнаяЯчейка.Ячейка.РабочийУчасток КАК Секция,
	               |		РасходныйОрдерНаТоварыТовары.Количество КАК Количество
	               |	ИЗ
	               |		Документ.РасходныйОрдерНаТовары.Товары КАК РасходныйОрдерНаТоварыТовары
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеОсновнаяЯчейка
	               |			ПО (РазмещениеОсновнаяЯчейка.Номенклатура = РасходныйОрдерНаТоварыТовары.Номенклатура)
	               |				И (РазмещениеОсновнаяЯчейка.ОсновнаяЯчейка = ИСТИНА)
	               |				И РасходныйОрдерНаТоварыТовары.Ссылка.Склад = РазмещениеОсновнаяЯчейка.Склад
	               |	ГДЕ
	               |		РасходныйОрдерНаТоварыТовары.Ссылка = &Ордер
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ПроблемныеОтгрузки.ДокументОтгрузки,
	               |		ПроблемныеОтгрузки.Ордер,
	               |		ПроблемныеОтгрузки.ВидЗаписи,
	               |		ПроблемныеОтгрузки.Номенклатура,
	               |		ПроблемныеОтгрузки.Характеристика,
	               |		ПроблемныеОтгрузки.Секция,
	               |		-ПроблемныеОтгрузки.Количество
	               |	ИЗ
	               |		_0_Эталон КАК ПроблемныеОтгрузки) КАК ВложенныйЗапрос
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходныйОрдерНаТовары.Товары КАК РасходныйОрдерНаТоварыТовары
	               |		ПО ВложенныйЗапрос.Номенклатура = РасходныйОрдерНаТоварыТовары.Номенклатура
	               |			И ВложенныйЗапрос.Характеристика = РасходныйОрдерНаТоварыТовары.Характеристика
	               |			И ВложенныйЗапрос.Ордер = РасходныйОрдерНаТоварыТовары.Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВложенныйЗапрос.ДокументОтгрузки,
	               |	ВложенныйЗапрос.Ордер,
	               |	ВложенныйЗапрос.Номенклатура,
	               |	ВложенныйЗапрос.Характеристика,
	               |	ВложенныйЗапрос.Секция,
	               |	РасходныйОрдерНаТоварыТовары.Подтверждена
	               |
	               |ИМЕЮЩИЕ
	               |	(СУММА(ВложенныйЗапрос.Количество) <> 0
	               |		ИЛИ РасходныйОрдерНаТоварыТовары.Подтверждена)
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Номенклатура,
	               |	Характеристика
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВложенныйЗапрос.ДокументОтгрузки КАК ДокументОтгрузки,
	               |	ВложенныйЗапрос.Ордер КАК Ордер,
	               |	ЗНАЧЕНИЕ(Перечисление.ВидыЗаписейПроблемныхДокументов.Накладная) КАК ВидЗаписи,
	               |	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	               |	ВложенныйЗапрос.Характеристика КАК Характеристика,
	               |	ВложенныйЗапрос.Секция КАК Секция,
	               |	СУММА(ВложенныйЗапрос.Количество) КАК Количество
	               |ПОМЕСТИТЬ ИзмененыВРеализацииНоНеИзмененыВОрдере
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		РеализацияТоваровУслугТовары.Ссылка КАК ДокументОтгрузки,
	               |		&Ордер КАК Ордер,
	               |		ЗНАЧЕНИЕ(Перечисление.ВидыЗаписейПроблемныхДокументов.Эталон) КАК ВидЗаписи,
	               |		РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
	               |		РеализацияТоваровУслугТовары.Характеристика КАК Характеристика,
	               |		РазмещениеОсновнаяЯчейка.Ячейка.РабочийУчасток КАК Секция,
	               |		ВЫБОР
	               |			КОГДА РеализацияТоваровУслугТовары.Упаковка <> ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	               |				ТОГДА РеализацияТоваровУслугТовары.Упаковка.Коэффициент * РеализацияТоваровУслугТовары.КоличествоУпаковок
	               |			ИНАЧЕ РеализацияТоваровУслугТовары.КоличествоУпаковок
	               |		КОНЕЦ КАК Количество
	               |	ИЗ
	               |		Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеОсновнаяЯчейка
	               |			ПО (РазмещениеОсновнаяЯчейка.Номенклатура = РеализацияТоваровУслугТовары.Номенклатура)
	               |				И (РазмещениеОсновнаяЯчейка.ОсновнаяЯчейка = ИСТИНА)
	               |				И РеализацияТоваровУслугТовары.Ссылка.Склад = РазмещениеОсновнаяЯчейка.Склад
	               |	ГДЕ
	               |		РеализацияТоваровУслугТовары.Ссылка = &Ссылка
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ПроблемныеОтгрузки.ДокументОтгрузки,
	               |		ПроблемныеОтгрузки.Ордер,
	               |		ПроблемныеОтгрузки.ВидЗаписи,
	               |		ПроблемныеОтгрузки.Номенклатура,
	               |		ПроблемныеОтгрузки.Характеристика,
	               |		ПроблемныеОтгрузки.Секция,
	               |		-ПроблемныеОтгрузки.Количество
	               |	ИЗ
	               |		_0_Эталон КАК ПроблемныеОтгрузки) КАК ВложенныйЗапрос
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ИзмененыВОрдере КАК ИзмененыВОрдере
	               |		ПО (ИзмененыВОрдере.Номенклатура = ВложенныйЗапрос.Номенклатура)
	               |			И (ИзмененыВОрдере.Характеристика = ВложенныйЗапрос.Характеристика)
	               |ГДЕ
	               |	ИзмененыВОрдере.Номенклатура ЕСТЬ NULL 
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВложенныйЗапрос.ДокументОтгрузки,
	               |	ВложенныйЗапрос.Ордер,
	               |	ВложенныйЗапрос.Номенклатура,
	               |	ВложенныйЗапрос.Характеристика,
	               |	ВложенныйЗапрос.Секция
	               |
	               |ИМЕЮЩИЕ
	               |	СУММА(ВложенныйЗапрос.Количество) <> 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВложенныйЗапрос.ДокументОтгрузки,
	               |	ВложенныйЗапрос.Ордер,
	               |	ВложенныйЗапрос.ВидЗаписи,
	               |	ВложенныйЗапрос.Номенклатура,
	               |	ВложенныйЗапрос.Характеристика,
	               |	ВложенныйЗапрос.Секция,
	               |	СУММА(ВложенныйЗапрос.Количество) КАК Количество,
	               |	ИСТИНА КАК Активность
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		_0_Эталон.ДокументОтгрузки КАК ДокументОтгрузки,
	               |		_0_Эталон.Ордер КАК Ордер,
	               |		_0_Эталон.ВидЗаписи КАК ВидЗаписи,
	               |		_0_Эталон.Номенклатура КАК Номенклатура,
	               |		_0_Эталон.Характеристика КАК Характеристика,
	               |		_0_Эталон.Секция КАК Секция,
	               |		_0_Эталон.Количество КАК Количество,
	               |		ИСТИНА КАК Активность
	               |	ИЗ
	               |		_0_Эталон КАК _0_Эталон
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ИзмененыВОрдере.ДокументОтгрузки,
	               |		ИзмененыВОрдере.Ордер,
	               |		ИзмененыВОрдере.ВидЗаписи,
	               |		ИзмененыВОрдере.Номенклатура,
	               |		ИзмененыВОрдере.Характеристика,
	               |		ИзмененыВОрдере.Секция,
	               |		ИзмененыВОрдере.Количество,
	               |		ИСТИНА
	               |	ИЗ
	               |		ИзмененыВОрдере КАК ИзмененыВОрдере
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ИзмененыВРеализацииНоНеИзмененыВОрдере.ДокументОтгрузки,
	               |		ИзмененыВРеализацииНоНеИзмененыВОрдере.Ордер,
	               |		ИзмененыВРеализацииНоНеИзмененыВОрдере.ВидЗаписи,
	               |		ИзмененыВРеализацииНоНеИзмененыВОрдере.Номенклатура,
	               |		ИзмененыВРеализацииНоНеИзмененыВОрдере.Характеристика,
	               |		ИзмененыВРеализацииНоНеИзмененыВОрдере.Секция,
	               |		ИзмененыВРеализацииНоНеИзмененыВОрдере.Количество,
	               |		ИСТИНА
	               |	ИЗ
	               |		ИзмененыВРеализацииНоНеИзмененыВОрдере КАК ИзмененыВРеализацииНоНеИзмененыВОрдере) КАК ВложенныйЗапрос
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВложенныйЗапрос.ДокументОтгрузки,
	               |	ВложенныйЗапрос.Ордер,
	               |	ВложенныйЗапрос.ВидЗаписи,
	               |	ВложенныйЗапрос.Номенклатура,
	               |	ВложенныйЗапрос.Характеристика,
	               |	ВложенныйЗапрос.Секция";

	
	Запрос.УстановитьПараметр("Ордер", Ордер);
	Запрос.УстановитьПараметр("Ссылка", ДокументОтгрузки);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции	

Функция ЕстьОрдерВСтатусеКОтбору(Ссылка) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходныйОрдерНаТовары.Ссылка
		|ИЗ
		|	Документ.РасходныйОрдерНаТовары КАК РасходныйОрдерНаТовары
		|ГДЕ
		|	РасходныйОрдерНаТовары.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРасходныхОрдеров.КОтбору)
		|	И РасходныйОрдерНаТовары.Проведен
		|	И РасходныйОрдерНаТовары.Распоряжение = &ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();	

КонецФункции

Процедура ОбновитьТаблицуТоваровОрдера(Ордер,Товары,ЕстьИзмененияВНакладной) Экспорт
	
	Товары.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроблемныеОтгрузки.Номенклатура,
		|	ПроблемныеОтгрузки.Характеристика,
		|	СУММА(ПроблемныеОтгрузки.Количество) КАК Количество,
		|	СУММА(ПроблемныеОтгрузки.Количество) КАК КоличествоУпаковок,
		|	ВЫБОР
		|		КОГДА РеализацияТоваровУслугТовары.Упаковка ЕСТЬ NULL 
		|			ТОГДА ПроблемныеОтгрузки.Номенклатура.ЕдиницаИзмерения
		|		ИНАЧЕ РеализацияТоваровУслугТовары.Упаковка
		|	КОНЕЦ КАК Упаковка
		|ИЗ
		|	РегистрСведений.ПроблемныеОтгрузки КАК ПроблемныеОтгрузки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|		ПО ПроблемныеОтгрузки.ДокументОтгрузки = РеализацияТоваровУслугТовары.Ссылка
		|			И ПроблемныеОтгрузки.Номенклатура = РеализацияТоваровУслугТовары.Номенклатура
		|			И ПроблемныеОтгрузки.Характеристика = РеализацияТоваровУслугТовары.Характеристика
		|ГДЕ
		|	ПроблемныеОтгрузки.Ордер = &Ордер
		|
		|СГРУППИРОВАТЬ ПО
		|	ПроблемныеОтгрузки.Номенклатура,
		|	ПроблемныеОтгрузки.Характеристика,
		|	ВЫБОР
		|		КОГДА РеализацияТоваровУслугТовары.Упаковка ЕСТЬ NULL 
		|			ТОГДА ПроблемныеОтгрузки.Номенклатура.ЕдиницаИзмерения
		|		ИНАЧЕ РеализацияТоваровУслугТовары.Упаковка
		|	КОНЕЦ";
	
	Запрос.УстановитьПараметр("Ордер", Ордер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		стр = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(стр,ВыборкаДетальныеЗаписи);
	КонецЦикла;
	ЕстьИзмененияВНакладной = Ложь;

КонецПроцедуры	

Функция СформироватьНаборЗаписейДляДокументовВСборке(Ссылка, Добавить=Истина) Экспорт 
	
	Если Ссылка.Статус = Перечисления.СтатусыРеализацийТоваровУслуг.Отгружено И
		НЕ Ссылка.Кассир = Справочники.Пользователи.ПустаяСсылка()      
		Тогда
		Попытка
			НЗ = РегистрыСведений.ДокументыВСборке.СоздатьНаборЗаписей();
			НЗ.Отбор.Документ.Установить(Ссылка);
			НЗ.Прочитать();
			Если НЗ.Количество() = 1 И Добавить Тогда
				Возврат Истина;
			ИначеЕсли НЗ.Количество() = 0 И Добавить Тогда
				стр = НЗ.Добавить();
				стр.Активность = Истина;
				стр.Документ   = Ссылка;
				стр.ДатаПоступленияВСборку = ТекущаяДата();
				НЗ.Записать();
				Возврат Истина;
			Иначе
				НЗ.Очистить();
				НЗ.Записать();
				Возврат Истина;
			КонецЕсли;
		Исключение
			#Если Клиент  Тогда
				Сообщить("Не удалось добавить документ в документы к сборке по причине: "+ОписаниеОшибки());
			#КонецЕсли
			Возврат Ложь;
		КонецПопытки;		
	Иначе
		НЗ = РегистрыСведений.ДокументыВСборке.СоздатьНаборЗаписей();
		НЗ.Отбор.Документ.Установить(Ссылка);
		НЗ.Прочитать();
		Если НЗ.Количество() > 0 Тогда
			НЗ.Очистить();
			НЗ.Записать();
        КонецЕсли;
		Возврат Истина;
	КонецЕсли;		 
		
КонецФункции	

Функция ОбновитьТаблицуТоваровРеализации(Реализация, Товары, ЕстьИзменения) Экспорт  
	
	Ордер = ВернутьПодчиненныйОрдер(Реализация);
	Если Не ЗначениеЗаполнено(Ордер) Тогда
		Возврат Ложь;
	КонецЕсли;
	Для Каждого стр Из Ордер.Товары Цикл
		Если стр.КоличествоУпаковок = 0 Тогда
			МасСтр = Товары.НайтиСтроки(Новый Структура("Номенклатура, Характеристика",стр.Номенклатура,стр.Характеристика));
			Если МасСтр.Количество()> 0 Тогда 
				Для Каждого ст Из МасСтр Цикл
					Товары.Удалить(Товары.Индекс(ст));
					ЕстьИзменения = Истина;
				КонецЦикла;	
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;
	Возврат ЕстьИзменения;
	
КонецФункции	

Функция ПоискСотрудникаПоШтрихкоду(ШК)  Экспорт
	
	Сотрудник = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.Ссылка КАК Объект
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.Код = &Штрихкод";
	
	Запрос.УстановитьПараметр("Штрихкод", ШК);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Сотрудник = ВыборкаДетальныеЗаписи.Объект;
	КонецЦикла;
	
	Возврат Сотрудник;
	
КонецФункции

Функция ПоискПользователяПоШтрихкоду(ШК)  Экспорт
	
	Пользователь = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.Ссылка КАК Сотрудник,
		|	Сотрудники.Пользователь
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.Код = &Штрихкод";
	
	Запрос.УстановитьПараметр("Штрихкод", ШК);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Пользователь = ВыборкаДетальныеЗаписи.Пользователь;
	КонецЦикла;
	
	Возврат Пользователь;
	
КонецФункции
